** 2025
:LOGBOOK:
CLOCK: [2025-03-11 Tue 18:15]--[2025-03-11 Tue 19:15] =>  1:00
CLOCK: [2025-03-04 Tue 18:15]--[2025-03-04 Tue 19:15] =>  1:00
CLOCK: [2025-02-25 Tue 18:15]--[2025-02-25 Tue 19:15] =>  1:00
CLOCK: [2025-02-18 Tue 18:15]--[2025-02-18 Tue 19:15] =>  1:00
CLOCK: [2025-02-11 Tue 18:15]--[2025-02-11 Tue 19:15] =>  1:00
CLOCK: [2025-02-04 Tue 18:15]--[2025-02-04 Tue 19:15] =>  1:00
CLOCK: [2025-01-28 Tue 18:15]--[2025-01-28 Tue 19:15] =>  1:00
CLOCK: [2025-01-21 Tue 18:15]--[2025-01-21 Tue 19:15] =>  1:00
CLOCK: [2025-01-14 Tue 18:15]--[2025-01-14 Tue 19:15] =>  1:00
CLOCK: [2025-01-07 Tue 18:15]--[2025-01-07 Tue 19:15] =>  1:00
:END:

#+CAPTION: Pilates Log 2025 (Notes from attending [[https://symmetrypilates.co.uk/][Symmetry Pilates]] with Sam Webster.)
#+NAME: pilates-log-2024
| Date                   | Notes                                                                                              | Exercise(s) to practice                                                                                                                                                                                                                                             |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-07-22 Tue 23:16] | Good session, mostly with magit rings | Up on toes (x10), rolldowns                                                                                                                             |
|                        |                                       | Ring in front, elbows level with shoulders, squeeze relax, focus on breathing correctly, repeat above head, core engaged, shoulders back throughout,    |
|                        |                                       | finally behind the back (impossible to actually squeeze), keep arms straight and shoulders back.                                                        |
|                        |                                       | Do small rollbacks using ring, hard to stop going all the way over when just on lower back!                                                             |
|                        |                                       | Stretch legs with ring, one leg "vertical", and then to both sides. really push heel past ring to get full stretch. Bend and extend (active stretching) |
|                        |                                       | Double leg circles with ring between ankles, squeezing.                                                                                                 |
|                        |                                       | Hundreds with ring between legs, make it harder by having the arms higher.                                                                              |
|                        |                                       | Pelvic tilt then bridges with ring between knees and then outside.                                                                                      |
|                        |                                       | Sideline involved clam but on elbow with torso lifted, smaller range but more resistance, clam, reverse clam (lifting both feet) then lifted clam.      |
|                        |                                       | Double leg-raises with ring, don't push or let top leg press down, lift lower. Followed by Fish, make sure not to let hips rock either direction.       |
|                        |                                       | Back stretches, lie on front ring round ankles and hold with both hands, push legs away and lift chest but keep head straight and looking down, repeat. |
|                        |                                       | Next try and lift knees and thighs off the ground, make sure to start by engaging pelvis and pushing into floor to start.                               |

| [2025-07-15 Tue 20:37] | Session after break, was good, felt strong                                                         | Warm up with hips, roll downs on flat and toes.                                                                                                                                                                                                                     |
|                        | and enjoyed despite heat (take/wear shorts you idiot!)                                             | Weights to waiter and lifting up to horizontal at side. Drawing sword, ensure hips are square in both directions.                                                                                                                                                   |
|                        |                                                                                                    | Core started with roll downs with weights, vertical leg circles, then opening leg and arm on same side (x10 each side), hold and breathe at end.                                                                                                                    |
|                        |                                                                                                    | Hundreds with weights, rolling up into straight legs, head and shoulders up, go slow with weights.                                                                                                                                                                  |
|                        |                                                                                                    | "Round the world", legs in table top, roll up and hands to one side of knees with weights, keep arms straight and circle behind head to other                                                                                                                       |
|                        |                                                                                                    | side of knees.                                                                                                                                                                                                                                                      |
|                        |                                                                                                    | Open book, leg circles, highland fling, up on elbow, twist and slide/thread arm under torso, keep torso engaged and straight, then repeat with hips                                                                                                                 |
|                        |                                                                                                    | off the ground.                                                                                                                                                                                                                                                     |
|                        |                                                                                                    | Finish side line with double leg lifts, then rise, slide up and twist into teaser.                                                                                                                                                                                  |
|                        |                                                                                                    | Back exercise (and triceps!), lie on front, weights plugged in at side, lift head and chest off ground but keep head down, lift weights and repeat                                                                                                                  |
|                        |                                                                                                    | hold for 5-10 seconds on last repetition.                                                                                                                                                                                                                           |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-06-24 Tue 19:52] | Good session, hot and hard work                                                                    | Great for quads and hamstrings...feet on weights, heels on floor, up into bridge, lift arms above head, toes to floor keeping them there as spine rolls down.                                                                                                       |
|                        |                                                                                                    | Sit upright, legs in front, chest and shoulders/head above hips, slightly forward if anything, pull toes back on one foot and lift, repeat then hold for 5. Repeat with toes turning outwards getting ankle pointing upwards. HARD!                                 |
|                        |                                                                                                    | With weights in dead bug, arms go back, then sit up and as doing so one leg extends as you curl up, repeat (x10), swap legs, repeat (x10), then repeat with double legs.                                                                                            |
|                        |                                                                                                    | Hundreds with weights and doing scissor legs (up and down) at the same time, not at the same pace but about half as fast, hard to co-ordinate!                                                                                                                      |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-06-17 Tue 19:58] | Fun session, smaller class (x4)                                                                    | Roll downs to warm up, circle arms, cross arms, arms behind back.                                                                                                                                                                                                   |
|                        |                                                                                                    | Weights, waiter with extensions out, arms in goal post from horizontal to vertical.                                                                                                                                                                                 |
|                        |                                                                                                    | Core work out involved rolling back with weights into 100s followed by holding and going into a teaser.                                                                                                                                                             |
|                        |                                                                                                    | Next leg circles both ways                                                                                                                                                                                                                                          |
|                        |                                                                                                    | Raising and lowering one leg with weights in hands rolling back as leg goes up to vertical, repeat both sides then do double.                                                                                                                                       |
|                        |                                                                                                    | Finally tick-tock with legs.                                                                                                                                                                                                                                        |
|                        |                                                                                                    | Bridges with feet on weights, toes go down, pelvic tilt and lift, arms over head, roll spine down, then arms come down.                                                                                                                                             |
|                        |                                                                                                    | Even harder is to roll the feet out and back on the weights whilst in bridge!                                                                                                                                                                                       |
|                        |                                                                                                    | Open book followed by leg circles, side-kicks (two-forward, one back), "smiles" and then double leg lifts (x10) flowing into                                                                                                                                        |
|                        |                                                                                                    | fish (x10), must remember to keep legs raised whilst doing fish.                                                                                                                                                                                                    |
|                        |                                                                                                    | Sitting back extensions, legs mat width apart, hands in middle slide forward, then again and again, pulling stomach in as you go.                                                                                                                                   |
|                        |                                                                                                    | Then with hands outside of legs slide forward, pulling stomach in, once forward lift and straighten back but not to vertical,                                                                                                                                       |
|                        |                                                                                                    | two types of rowing arms were then done but I forget the details.                                                                                                                                                                                                   |
|                        |                                                                                                    | Some good stretching, on all fours like a cat pull pelvis up roll back onto heels, forearms to ground then slide forward until                                                                                                                                      |
|                        |                                                                                                    | shoulders go past hands and raise up, repeat.                                                                                                                                                                                                                       |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-06-10 Tue 21:09] | Fun session again                                                                                  | Warming up by going up onto toes x5 then lowering, and raising, once, then lower then hold.                                                                                                                                                                         |
|                        |                                                                                                    | Walk hands down into plank, alternate leg raises, then turn sideways (feet on sides) and reach up and over head with upper arm                                                                                                                                      |
|                        |                                                                                                    | pushing hips up, repeat both sides x5                                                                                                                                                                                                                               |
|                        |                                                                                                    | Roll downs then roll downs on toes                                                                                                                                                                                                                                  |
|                        |                                                                                                    | Roll like a ball, followed by roll backs then hundreds, keep head and shoulders up.                                                                                                                                                                                 |
|                        |                                                                                                    | Table top, roll up and into teaser, repeat x5 then repeat but when roll back down a little and go back, hard!                                                                                                                                                       |
|                        |                                                                                                    | Pelvic tilts with feet on the ground, followed by bridges and then with legs in table pelvic tilt, very small but hard movement!                                                                                                                                    |
|                        |                                                                                                    | Sideline was openbook, then dragging upper leg up lower leg, extend flex heel and lower (x10)                                                                                                                                                                       |
|                        |                                                                                                    | followed by turning toe up and "smiles". After bring leg behind and hold in hand and stretch                                                                                                                                                                        |
|                        |                                                                                                    | moving into bicycle circles, both normal and reverse. Finally double leg raise and scissors.                                                                                                                                                                        |
|                        |                                                                                                    | Back work on front, hands by shoulders, elbows tucked in, roll chest forward and lift slightly, keep head down raise hands, repeat                                                                                                                                  |
|                        |                                                                                                    | and then extend by extending arms out in front of you.                                                                                                                                                                                                              |
|                        |                                                                                                    | Myofascial release went up spine, feet slightly wider than hips and rocking side to side, when between shoulder blades can bring                                                                                                                                    |
|                        |                                                                                                    | knee up to chest one at a time, hug and then circle.                                                                                                                                                                                                                |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-06-03 Tue 19:54] | Another fun session, asked for legs and hips (Ruth                                                 | Warm up raising onto toes.                                                                                                                                                                                                                                          |
|                        | asked for glutes) and we got what we asked for!                                                    | Upper body with weights swinging arms and raising knee x5 hold on last for 5 seconds, breathing and swap. Drawing sword with both weights make sure to get full rotation and hips square on extension.                                                              |
|                        |                                                                                                    | Alternate leg-arm extensions x10 (each side so twenty) then same side x10 (both sides!)                                                                                                                                                                             |
|                        |                                                                                                    | Up on elbows, shoulders back pelvis tucked in and look at stomach, both legs raise to vertical and circle both ways alternating x10                                                                                                                                 |
|                        |                                                                                                    | Weights in hands, palms to back of forehead, legs in table-top, head and shoulders raised then twist elbow to opposite knee, switch and repeat.                                                                                                                     |
|                        |                                                                                                    | Hundreds with weights                                                                                                                                                                                                                                               |
|                        |                                                                                                    | Side-line with flow, after open book and arm circles raised clams (x10), leg extensions (point toes on the way out) x10, then leg circles x10 both directions, don't let hips wobble!                                                                               |
|                        |                                                                                                    | Three sets of the following with four reps of each then switch sides...                                                                                                                                                                                             |
|                        |                                                                                                    | + Highland fling (first set toe taps, second heel/toe, third whatever)                                                                                                                                                                                              |
|                        |                                                                                                    | + Leg "smiles", with toe turned out/up on forwards                                                                                                                                                                                                                  |
|                        |                                                                                                    | + Fish                                                                                                                                                                                                                                                              |
|                        |                                                                                                    | Back extensions with hand diamond, was corrected to push hips into ground more, shoulders a bit lower, alternate salutes, then raising opposite leg                                                                                                                 |
|                        |                                                                                                    | Finished with some myofascial release of shoulders and glutes.                                                                                                                                                                                                      |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-05-27 Tue 21:29] | Good session, nice to see Sarah back, thought she might have canned it                             | Balance to warm up, leg into table top then lean forward extend leg behind and arms out, repeat x5 then on last bend knee x5, holding on last for 5 seconds.                                                                                                        |
|                        | Found balance stuff at start hard on mat, easier on the hard floor                                 | Tik-tok with legs vertical, arms out wide by shoulders. Hips allowed to come off and legs go as far as possible as long as shoulder stays in place.                                                                                                                 |
|                        |                                                                                                    | Keep legs vertical, arms above head, opposite arm goes to outside of opposite leg  (like saw) and raise shoulder off going across then lift body up with a bit of pressure on arm on floor.                                                                         |
|                        |                                                                                                    | Roll backs, then roll backs coming into teaser, and holding, then teaser with arms flapping then teaser with heel kicks.                                                                                                                                            |
|                        |                                                                                                    | Side line with band, open-book, clam, raised clam, leg extensions leg circles x6 each way, highland fling, single leg raise, double leg raise scissors (knackering!)                                                                                                |
|                        |                                                                                                    | Lie on front in star-fish with theraband in hands, lift chest then rotate to one side opening chest with head staying straight/low, twist from upper waist/chest, don't drop head (hard)                                                                            |
|                        |                                                                                                    | Stretching thighs lie on front bend knees and kick up with straight then bent ankle, alternate legs the move to frog and lift both knees off x6-8, then extend legs when knees are lifted.                                                                          |
|                        |                                                                                                    | Patting body down at end (seemed unlikely to make much difference but was fun!)                                                                                                                                                                                     |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-05-20 Tue 20:37] | Nice session, used overball for a lot of things.                                                   | Circle hips, stretch over, roll downs.                                                                                                                                                                                                                              |
|                        | Enjoyed it, found I was able to focus on form                                                      | Overball under shoulders, small roll-up into chest, arching back over ball to open chest up.                                                                                                                                                                        |
|                        | rather than trying to be strong in everything.                                                     | Overball under hips, dead bug, opposing arm/leg extensions, then same side extensions, engage hips to keep core straight and don't let things roll to one side.                                                                                                     |
|                        |                                                                                                    | Single leg bicycle x5 each way, each side then double x5 each way, knackering! Followed by double leg-cycles. Ideally all as one flow sequence.                                                                                                                     |
|                        |                                                                                                    | Oblique exercises with hips supported on ball, bend both knees out to one side. Then do "tick-rock" with legs straight and move in circles.                                                                                                                         |
|                        |                                                                                                    | Short rest then hundreds.                                                                                                                                                                                                                                           |
|                        |                                                                                                    | Open book followed by circles, then double leg raises with overball between ankles (x10) hold on end the short scissor kicks.                                                                                                                                       |
|                        |                                                                                                    | Smile/half-circle with upper leg, then highland-fling with heel/knee touching                                                                                                                                                                                       |
|                        |                                                                                                    | Upper leg knee on ball, lower leg raise as high as thigh, then circles (both ways x10), finally roll out hips on overball (nice!)                                                                                                                                   |
|                        |                                                                                                    | Back extensions/exercises, on knees, back straight (noticed mine was curved when I checked so pull pelvis in to flatten) come off knees to start with.                                                                                                              |
|                        |                                                                                                    | Next do full plank.                                                                                                                                                                                                                                                 |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-05-13 Tue 22:03] | Great session, despite heat                                                                        | Hips, side stretch and roll-downs to warm up.                                                                                                                                                                                                                       |
|                        |                                                                                                    | Weights around head next, then drawing sword with both in one hand.                                                                                                                                                                                                 |
|                        |                                                                                                    | Dead bug and alternate arms going out, then same side. x10 reps on each.                                                                                                                                                                                            |
|                        |                                                                                                    | Core work out was hard, don't remember exact sequence but involved...                                                                                                                                                                                               |
|                        |                                                                                                    | + alternating legs (opposite hand on knee same hand on side) with head and shoulders up                                                                                                                                                                             |
|                        |                                                                                                    | + twisting to opposite (remember to twist upper body, not head and reach far)                                                                                                                                                                                       |
|                        |                                                                                                    | + double leg raises, remember to keep back to the ground.                                                                                                                                                                                                           |
|                        |                                                                                                    | Mermaid with arching over a few times, then twisting to the ground followed by raising up                                                                                                                                                                           |
|                        |                                                                                                    | on to knees.                                                                                                                                                                                                                                                        |
|                        |                                                                                                    | Side line work was done on elbow, raising torso up to 45-degree angle, made everything HARD!                                                                                                                                                                        |
|                        |                                                                                                    | + leg circles                                                                                                                                                                                                                                                       |
|                        |                                                                                                    | + slide upper foot along lower leg, extend (bent foot) and bring back down                                                                                                                                                                                          |
|                        |                                                                                                    | + upper leg toes pointing up and semi-circles                                                                                                                                                                                                                       |
|                        |                                                                                                    | "Fish rolls" - lie on side double leg raise, upper hand on top thigh, slide up bringing lower arm                                                                                                                                                                   |
|                        |                                                                                                    | up but not pushing then roll onto bum, either table top, roll like a ball or hardest into teaser.                                                                                                                                                                   |
|                        |                                                                                                    | Did some neck release stuff, bit weird but pushing on muscles coming out of neck into clavicle                                                                                                                                                                      |
|                        |                                                                                                    | felt good and worthwhile though.                                                                                                                                                                                                                                    |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-05-06 Tue 20:29] | Good session, strong core workout                                                                  |                                                                                                                                                                                                                                                                     |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-04-29 Tue 19:54] | Nice session                                                                                       | Theraband for upper body work out, core sideline then legs with theraband.                                                                                                                                                                                          |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-04-22 Tue 20:43] | Nice session, decided to not note down exercises that we've done before                            | Sit and hold shins (harder lower down to wards ankles), roll back and pull stomach in and keep feet at same height (just off the ground) and gently roll back and then forward, repeating. Surprisingly hard.                                                       |
|                        | but instead just record new things or those that stand out.                                        | Bridges with feet on weights were incredibly hard and cramps in thighs/calves.                                                                                                                                                                                      |
|                        |                                                                                                    | Back exercises with arms in goal post, tuck pelvis in and roll ball out with chest, lift arms off ground, repeat. Extension is to the extend arms forwards and above head without chest dropping.                                                                   |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-04-15 Tue 20:01] | Sam's back! Great to see her again, glad she had a good wedding and trip to South Africa.          | Warm up hips and stretch over (after rolling out the feet)                                                                                                                                                                                                          |
|                        | Lots of work with soft ball to help open chest and back up and engage core more when lifting       | Ball under shoulder blades, stretch back over. Next table-top, hands behind head (ball for support) and single leg raises, alternate then follow with double leg raises with ball between ankles and squeezing, keeping curled forward.                             |
|                        | legs, some good back work.                                                                         | Ball between knees and polish table (whilst curled up!), then legs up to vertical and circle (bigger are harder).                                                                                                                                                   |
|                        |                                                                                                    | Hundreds with ball between ankle and make sure shoulders stay up off ground (but not hunched).                                                                                                                                                                      |
|                        |                                                                                                    | Finally twist/switches to alternate knee (unlike Nina it was elbow to knee rather than elbow to ground), make sure to keep both shoulders raised.                                                                                                                   |
|                        |                                                                                                    | Open book followed by double leg-lifts with ball between ankles, hold and end and baby scissors.                                                                                                                                                                    |
|                        |                                                                                                    | Upper knee bent and on ball, lower leg raises, 8-10 circles each way, then 8-10 figure of eight circles with legs both ways.                                                                                                                                        |
|                        |                                                                                                    | Back extensions with ball between upper thighs, push pelvis down into the ground and roll chest out and saluting first each hand then both and hold, repeat. Don't go too high and really push pelvis so glutes go down.                                            |
|                        |                                                                                                    | Extension is double salute and bend knees then try and lift thighs off the ground hard!                                                                                                                                                                             |
|                        |                                                                                                    | Finished with myofascial release of shoulders and upper glutes both of which felt great.                                                                                                                                                                            |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-04-08 Tue 20:56] | Nina again, she seemed slightly gentler!                                                           | Stretch feet out on ball, but after a scrunching lifting and splaying of toes to work them a bit more.                                                                                                                                                              |
|                        |                                                                                                    | Down on the mats for a five core workout, forget what the sequence was but involved hundreds without pumping, just holding and breathing; single legs, head up hold one leg, pull-pull and switch;                                                                  |
|                        |                                                                                                    | thigh above hip and extend, then out to side then other then circles, keep other leg flat on floor; one leg up in table top other raised, outside hand on ankle of raised leg other hand on knee                                                                    |
|                        |                                                                                                    | and switch.                                                                                                                                                                                                                                                         |
|                        |                                                                                                    | Side stuff was same as previous weeks so see notes, make sure to turn upper leg out and extend throughout.                                                                                                                                                          |
|                        |                                                                                                    | Did a good side stretch from shell, hands out to side and breathe deeply.                                                                                                                                                                                           |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-04-01 Tue 21:04] | Nice session with Nina again                                                                       | Stretching feet out again to start with, really grip ball with toes and go across, press hard down into arch of foot.                                                                                                                                               |
|                        |                                                                                                    | Roll backs, really need to pull my chest down when arms above and behind me, use breathing to help do so.                                                                                                                                                           |
|                        |                                                                                                    | Leg work, pull knee to chest and extend lower leg, bend foot back and forth try kicking a little. Move on to thigh above leg and going across body followed by circles.                                                                                             |
|                        |                                                                                                    | Core work good sequence but can;t remember what it was, involved hands behind head and shoulders up, table top then extend one leg, hand on same side as raised leg by                                                                                              |
|                        |                                                                                                    | ankle, opposite on knee and switch, repeat. Followed by hundreds (not essential to bounce hands, but breathing important), then double leg raises, making sure head and                                                                                             |
|                        |                                                                                                    | shoulders remain off the ground. Rather than opposite elbow to knee do the same twist but get elbow that is being lowered to the ground and look into armpit (was good).                                                                                            |
|                        |                                                                                                    | Roll like a ball followed by roll back and over.                                                                                                                                                                                                                    |
|                        |                                                                                                    | Sit and lift legs, hold under thighs or above ankles and roll back and forward, hard to balance at front, one to work on.                                                                                                                                           |
|                        |                                                                                                    | Side line, back of mat legs to front lift upper leg and twist foot out, forward kick-kick and back, extend legs, keep core engaged on elbow and use breath. Raise upper                                                                                             |
|                        |                                                                                                    | leg, leg circles (forward and backwards x8) then keep upper leg raised and lift lower leg to meet, then both legs. Onto front with thighs off the ground and beats                                                                                                  |
|                        |                                                                                                    | On front lifting chest, head down to start then up a bit more. Top of feet should be on floor, push into press-up a little to extend further. Extra is raising legs and                                                                                             |
|                        |                                                                                                    | rocking back and forth.                                                                                                                                                                                                                                             |
|                        |                                                                                                    | Mermaid and stretching over, push up not sideways, keep back straight. Followed by hands both on legs breathing out and down getting head towards knees.                                                                                                            |
|                        |                                                                                                    | Side twists sitting with legs out.                                                                                                                                                                                                                                  |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-03-25 Tue 19:42] | Fun session, Sam on holiday getting married so had Nina who climas to                              | Opened feet up nicely at start, more guiding. Start with rolling back and forth then heel on ground and open toes out wide with ball under ball of foot. Move back and a bit to mid feet and repeat. Can't do enough of this.                                       |
|                        | do more classical Pilates. Was fun, got prodded and pushed around a                                | Pilates stance and up onto toes keeping heels together, rising up through roof of mouth (string pulling head up). Hold in middle for extra effect.                                                                                                                  |
|                        | bit more which means my form isn't great. Must engage stomach more!                                | Lie flat, heels together toes turned out, glutes and inner thighs engaged, roll back arms behind head, don't flare chest keep shoulders down hands don't need to touch the ground. Rollback up                                                                      |
|                        |                                                                                                    | Theraband under armpits, tuck stomach in, chin to chest and lean forward trying to get head to knees, after a few warm ups go further by pulling theraband to ground. Follow with half-roll backs with theraband around feet.                                       |
|                        |                                                                                                    | Single leg raised get thigh and knee above hip, keep opposite on the floor, theraband around foot which flexes back and forth, followed by going out to either side alternately                                                                                     |
|                        |                                                                                                    | Single leg raises, head and chest rolled up outside hand on same leg opposite hand on knee then switch. Double leg raises followed opening out with hands above chest.                                                                                              |
|                        |                                                                                                    | On side on back of mat, feet at opposite side, lift upper leg and rotate outwards, hold. Follow with double kicks and avoid hitching hips. Then small circles both directions but really engage stomach.                                                            |
|                        |                                                                                                    | Onto front and diamond for face, push pelvis down and lift thighs off the ground, then both legs and do beats (about 50 I think). Switch over to other side, repeat side work and repeat stomach and beats.                                                         |
|                        |                                                                                                    | On front push up to raise chest, keep eyes down/looking forward, bend knees and try and kick bum twice alternating legs.                                                                                                                                            |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-03-11 Tue 20:17] | Good session, regular crowd requested core work and definitely got that!                           | Hips, side stretch, crossed arms and roll down half-way with deep breath to warm up                                                                                                                                                                                 |
|                        |                                                                                                    | Band work, hold double arms out in front and roll out and down to side until hands are near (touching! the floor), rotate up on side over and down to the other side and return to center, repeat on opposite side.                                                 |
|                        |                                                                                                    | Several slight variations on this (don't remember details and first time we've done it) followed by palms up and opening chest, bounces at end, repeat with palms down.                                                                                             |
|                        |                                                                                                    | Band behind chest and hold ends out in front, roll back on lower back lowering down one bone at a time then arms behind head, band shouldn't slip, roll back up extending hands out to feet with head down to knees                                                 |
|                        |                                                                                                    | return to sitting.                                                                                                                                                                                                                                                  |
|                        |                                                                                                    | Core work out! Keep shoulders up at all times!                                                                                                                                                                                                                      |
|                        |                                                                                                    | 1. One leg extended other with same hand touching ankle, opposite on knee, switch x10 each side.                                                                                                                                                                    |
|                        |                                                                                                    | 2. Lift head up with hands behind head, opposite elbow/knee, repeat x10 each side                                                                                                                                                                                   |
|                        |                                                                                                    | 3. Straight-leg alternate raises perhaps?                                                                                                                                                                                                                           |
|                        |                                                                                                    | 4. Double leg raises.                                                                                                                                                                                                                                               |
|                        |                                                                                                    | 5. Finish with both legs raised, hands towards knees, lowering legs and circling arms                                                                                                                                                                               |
|                        |                                                                                                    | Hundreds!                                                                                                                                                                                                                                                           |
|                        |                                                                                                    | On elbows, legs in table top and circles on top of table, followed by legs vertical and circles with ankles                                                                                                                                                         |
|                        |                                                                                                    | Bridges with band over waist, hands anchored on floor, lifting up, should be able to see hips. Then one leg in table top, repeat and swap sides.                                                                                                                    |
|                        |                                                                                                    | Open book with band around legs (above knee) followed by, clam, raised clam, leg extensions, side kicks (hard with band), lower leg raises, double leg raises and big scissors                                                                                      |
|                        |                                                                                                    | Back extensions, really need to keep my shoulder blades down and pushing in to each other. Band under hips, pelvis in lift head and sternum (keep head down) lift hands, repeat. Followed by  similar but band above                                                |
|                        |                                                                                                    | legs, palms down and lifting hands round out in front finishing with palms down.                                                                                                                                                                                    |
|                        |                                                                                                    | Myofascial release on thighs (one ball on each), start with tilting pelvis, then raise legs. Try and keep knees on ground initially then raise them, rock legs. Repeat going down the thigh.                                                                        |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-03-04 Tue 19:38] | Good session, lots of legs and hips                                                                | Warm up with usual hips, arching hand over but with a rotation of raised arm down to opposite side. Roll downs plus on toes.                                                                                                                                        |
|                        |                                                                                                    | Dead-bug opposite arms and legs, then with head on floor straight arms and legs out (opposite). Something with double legs but can't remember, may have had head and shoulders up.                                                                                  |
|                        |                                                                                                    | Tree...one leg flat, other raised to chest with hands behind knee, roll back a little, pull forward, should be sitting up very straight. Gently roll back and straighten leg out balancing and walk hand sup get, then go back down to horizontal walking hands     |
|                        |                                                                                                    | down the leg keeping shoulders off the floor and core engaged. Walk hands down the leg and return to sitting. Repeat. Quite hard!                                                                                                                                   |
|                        |                                                                                                    | Open book followed by leg circles, small, medium large in alternating directions, about eight sets. Raised upper leg, lift lower leg to meet, double leg lifts, then fish.                                                                                          |
|                        |                                                                                                    | Raise upper leg and with foot bent turn toes out then int, repeat followed by U/smile swings, making sure not to let hips wobble.                                                                                                                                   |
|                        |                                                                                                    | On front with hands by shoulders, elbows anchored on side, push pelvis down toes on ground raise knees and roll ball out with sternum keeping head down, repeat x5 then extend arms out above head/shoulders.                                                       |
|                        |                                                                                                    | Seal roles, always good fun :-)                                                                                                                                                                                                                                     |
|                        |                                                                                                    | Also did roll overs earlier in the session, do more of these they're good workout for core (along with the obligatory 100s)                                                                                                                                         |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-25 Tue 20:05] | Larger class today, bit less strenuous than last week                                              | Hips and ankle raises, sliding down wall, roll downs                                                                                                                                                                                                                |
|                        |                                                                                                    | Ring for half-roll backs onto lower back then diving head forward to knees, straighten up and repeat.                                                                                                                                                               |
|                        |                                                                                                    | Use ring to stretch leg dynamically whilst lying on back keeping other leg anchored on floor, straight up, across and out to side.                                                                                                                                  |
|                        |                                                                                                    | Bridge with ring on outside.                                                                                                                                                                                                                                        |
|                        |                                                                                                    | Leg circles in frog with ring between (or possibly around) ankles.                                                                                                                                                                                                  |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-18 Tue 20:24] | Great session, lots of core                                                                        | Started with ball and foot work, sideways over toes, midfoot, heel, then length wise (both feet)                                                                                                                                                                    |
|                        |                                                                                                    | Hip stirring, then raising up on toes followed by crossing arms in front at chest height and lowering down with back straight (sliding down a wall), repeat the slides a few times hold on last.                                                                    |
|                        |                                                                                                    | Weights in arms and swings back and forth with one foot behind other, then raise opposite knee and arm and hold, repeat. On last hold....and close eyes for five seconds.                                                                                           |
|                        |                                                                                                    | Table-top, opposite arms and legs extend and come back. Then co-ordination with leg going out to 45 degrees, arm back, leg outs out sideways (don't let hips lift) whilst arm circles out to side                                                                   |
|                        |                                                                                                    | bring leg and arm in at the same time, switch sides and repeat. Seemed hard to co-ordinate the circling compared to just extending!                                                                                                                                 |
|                        |                                                                                                    | Dead bug with weights, one leg out and arms back then circle round to bring arms back in. Opposite leg repeating x10 each side then both legs. Involved lying back and head/shoulders raising up                                                                    |
|                        |                                                                                                    | in opposition. Can't quite remember exactly, finished with double legs, was knackering.                                                                                                                                                                             |
|                        |                                                                                                    | Raise head and shoulders up, legs in table top and dust top of table with legs in circles.                                                                                                                                                                          |
|                        |                                                                                                    | 100s followed this, which was knackering on the core.                                                                                                                                                                                                               |
|                        |                                                                                                    | Roll-overs but starting with legs vertical and coming back to that position. Then "corkscrew" where when lowering do so on one side, roll over to other side when legs vertical, then roll back                                                                     |
|                        |                                                                                                    | on the opposite side, hard and very good for imbalance in back (something I seem to have when sat at desk).                                                                                                                                                         |
|                        |                                                                                                    | Open-book, side kicks and leg circles (both directions) with arm on floor, hand supporting head. Repeat but with elbow resting on floor, hand supporting head and opposite hand on back of head.                                                                    |
|                        |                                                                                                    | Important to make sure I don't twist (picked up on this multiple times), engage core, keep chest in and don't let hips rotate. Hard! Done on both sides                                                                                                             |
|                        |                                                                                                    | Then, one knee other leg out-stretched (forward of waste if needed is easier) and lower out so opposite arm is on floor. Upper arm over head, lift leg up to hip height (hard!), then forward kicks                                                                 |
|                        |                                                                                                    | (even harder), then circles both ways (really hard!).                                                                                                                                                                                                               |
|                        |                                                                                                    | Back stretches, sit with toes pointed, hands flat on ground by thighs and slide forward when at extreme should be pulling stomach and rubs in and stretching neck, shoulders should be forward of                                                                   |
|                        |                                                                                                    | hips, staying leaning forward lift toes and raise arms up to 45 degrees, extending neck.                                                                                                                                                                            |
|                        |                                                                                                    | Back release starting at low back and moving up, balls either side of spine, knees rocking, mid-spine arms go back over head, at tope (shoulders), don't bother moving knees.                                                                                       |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-11 Tue 20:14] | Another great session, really feel like Sam is pushing us now.                                     | Warm up hips, stretch over, roll downs                                                                                                                                                                                                                              |
|                        | Lots of band work, basically everything with band                                                  | Band and open chest, arms out in front and open, then over head, band behind legs and pull forward reverse with band in front of legs and pulling back.                                                                                                             |
|                        |                                                                                                    | Sit with band round feet, roll back a little and pull arms up to chest (bicep curls).                                                                                                                                                                               |
|                        |                                                                                                    | Band round foot for leg circles, ham string stretch (really push heel, keep knee straight and pull back), repeat out to both sides. Bicycles both ways with band.                                                                                                   |
|                        |                                                                                                    | Band behind head cradling, lift up and toe tap x10 each side, shoulders off floor, then opposite elbow to knee and alternate.                                                                                                                                       |
|                        |                                                                                                    | Hundreds with band.                                                                                                                                                                                                                                                 |
|                        |                                                                                                    | Side line, open book, arm circles, band round knees and clam, raised clam, hold and extend, leg circles both directions, highland fling (flow sequence no resting)                                                                                                  |
|                        |                                                                                                    | Lie on front band underneath, pubic bone pushing into ground, roll ball forward, shoulder blades pushing in to touch and lift arms.                                                                                                                                 |
|                        |                                                                                                    | Lie on front band above, pubic bone pushing into ground, roll ball forward, shoulder pushing in, lift arms and bring forward over the head                                                                                                                          |
|                        |                                                                                                    | Myofascial release on glutes (both at same time) and then each side                                                                                                                                                                                                 |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-04 Tue 22:39] | Great session, had to work hard. Weights throughout with core and legs.                            | Hips, side stretch and roll down to warm up                                                                                                                                                                                                                         |
|                        |                                                                                                    | Weights in hand , one step back swing arms, after a set (6-10) keep going but raise one leg to table top, hold then step back and repeat swings.                                                                                                                    |
|                        |                                                                                                    | After several sets hold and swing arms, quite tricky, especially with heavier weights.                                                                                                                                                                              |
|                        |                                                                                                    | 100s with weights                                                                                                                                                                                                                                                   |
|                        |                                                                                                    | Leg circles followed by lots of leg work (I asked for it), all starting with raising shoulders off the ground and tucking chin to engage                                                                                                                            |
|                        |                                                                                                    | the upper torso, then...scissors with legs straight, switching (having weights over forehead and crossing shoulder to opposite knee).                                                                                                                               |
|                        |                                                                                                    | Double leg raises, bicycle leg, single both sides then double                                                                                                                                                                                                       |
|                        |                                                                                                    | Open book, side kicks (x2 forward, x1 back) always keep hips in-line, engage stomach as you kick, don't hitch hip.                                                                                                                                                  |
|                        |                                                                                                    | Lower leg lift x10 then circle both ways (x8-10)                                                                                                                                                                                                                    |
|                        |                                                                                                    | Flow sequence, three sets of the following, each repeated x5 figure of 8, fish/side slide, U-s with leg.                                                                                                                                                            |
|                        |                                                                                                    | Back and arms lie on front, push pelvis in hard, legs and arms (with weights) extended, mat width apart. Lift opposite sides.                                                                                                                                       |
|                        |                                                                                                    | Weights at side, legs together raise arms, hard but good for triceps.                                                                                                                                                                                               |
|                        |                                                                                                    | Legs in frog (bent at knee with heels touching), raise knees, repeat then hold.                                                                                                                                                                                     |
|                        |                                                                                                    | On all 4's straight back no dipping or bending, raise opposite hand/foot then lift toe of foot on floor, hard! Hold repeat, then tuck raised                                                                                                                        |
|                        |                                                                                                    | arm under torso (keeping toes off the ground). Hard!                                                                                                                                                                                                                |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-01-28 Tue 21:50] | Great session, lots of work on core and hips                                                       | Hips and over arm stretches to start, roll-downs and standing on tip-toe (x10 repeats with heels together hold then slide up and down wall)                                                                                                                         |
|                        |                                                                                                    | Ring out in front elbows up and chest forward, push don't curl inwards. Above head then behind back (always impossible but keep arms straight)                                                                                                                      |
|                        |                                                                                                    | Leg work opening ham strings, ring around ball of foot and roll back keeping other leg on floor. Really push the heel to wards the ceiling and                                                                                                                      |
|                        |                                                                                                    | get as high as possible. Then bend and straighten, really push with heel and make sure other leg/hip is relaxed and doesn't raise. Repeat going                                                                                                                     |
|                        |                                                                                                    | across the body then out to the side.                                                                                                                                                                                                                               |
|                        |                                                                                                    | Opposite (I think) hand and foot with ring, other hand behind head, roll up and across. Followed by switching.                                                                                                                                                      |
|                        |                                                                                                    | Baby scissor kicks then full scissor kicks (x10)                                                                                                                                                                                                                    |
|                        |                                                                                                    | Side line followed by the following done quickly in sequence x10 each : raised clam, finish open and extend and close legs (frog like turning toes in and straightening)                                                                                            |
|                        |                                                                                                    | x10 big circles each direction; 3 sets of highland fling (toes, heels, heel/knee progressing through sets), forward kick, x6-8 fish slides on side lower arm under ear                                                                                              |
|                        |                                                                                                    | flat slide hand down side resisting with head bringing torso off the ground. Finally ring between legs for double leg raises.                                                                                                                                       |
|                        |                                                                                                    | Front stretches with ring out front arms straight push down, keep head above shoulders all the time, lift sternum, after a few repeats go further by pulling ring back                                                                                              |
|                        |                                                                                                    | after pushing down.                                                                                                                                                                                                                                                 |
|                        |                                                                                                    | Ring round ankles and straighten legs, opens chest, pull shoulders together. Extend by trying to raise knees                                                                                                                                                        |
|                        |                                                                                                    | Bridge with ring between knees was really good, arms above head eventually and then make harder by holding and raising alternate legs                                                                                                                               |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-01-21 Tue 21:18] | Great session, lots of core work! Mostly with large soft ball                                      | Loosen hips, stretch over both sides, cross arms and bend over arms out behind and bend down.                                                                                                                                                                       |
|                        |                                                                                                    | Ball under hips into dead bug and extend opposite arm and leg, alternate (try not to lose balance!). With legs in table open one knee out to the side, keeping chest anchored and other knee straight. Finally both knees over almost as far as tipping then back.  |
|                        |                                                                                                    | All leg (core!) exercises with ball under shoulders, hands behind head and curling up high. Alternate leg circles, both leg circles (both directions x5-8)                                                                                                          |
|                        |                                                                                                    | One leg up in table top other straight, hold ball with same hand, opposite hand behind head, lean up and bring elbow of hand behind head to hold ball in place and put both hands behind head. Hold and take goes at trying to push ball up towards ceiling,        |
|                        |                                                                                                    | keeping same side shoulder off floor. Really hard!                                                                                                                                                                                                                  |
|                        |                                                                                                    | Side line with ball between legs followed by double leg raises with ball between ankles and little switches at the end. Move on to lower leg raises (upper leg resting on ball) x8-10 raises followed by circles in both directions, point toes, keep core engaged. |
|                        |                                                                                                    | Figure of 8 in both directions (x8-10) to warm down.                                                                                                                                                                                                                |
|                        |                                                                                                    | Back work with ball between thighs, squeeze tight and push pelvic bone down throughout. Start with raising sternum up and double hand salute, holding then back down (x3-5) then repeat but extend arms out and back in (x3-5) on last hold and breathe.            |
|                        |                                                                                                    | Ball still between thighs, up onto toes, hands beside chest, elbows tucked in and by chest too, lift knees then lift hands off the ground 3-5cm keeping elbows in-line.                                                                                             |
|                        |                                                                                                    | Kneeling planks with ball between thighs, make sure chest isn't flared, shoulder blades are pulling back into each other, from hands and knees lift knees slightly and hold, head up and sternum out but no flaring chest.                                          |
|                        |                                                                                                    | Full plank in similar as with kneeling but after a few roll to side, keeping ball between legs and lifting into side plank, don't let hips drop, open upper arm out, this was challenging but felt good when it worked.                                             |
|                        |                                                                                                    | Finished with some myofascial of shoulders, glutes and ankles, ankles is good and should be done more regularly, ball under fleshy part near ankle, lean forward, pull toes back, push heel away and down. Not comfortable but good, roll to both sides.            |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| <2025-01-14 Tue 20:27> | Really good session, smaller class today (4 people), lots of band work for arms/shoulders, core,   | Warm up hips, stretch over, roll downs.                                                                                                                                                                                                                             |
|                        | legs                                                                                               | Band and open chest with elbows anchored on chest, then arms straight out front and open. Stand on band on one side and lift in front to above head, repeat x10 then on last out to side lowering to horizontal with shoulders, don't                               |
|                        |                                                                                                    | flare the chest. Band over thighs, arms straight and hands behind back.                                                                                                                                                                                             |
|                        |                                                                                                    | Theraband round feet in sitting and roll back onto lower back. Double band round feet, knees apart, arms hugging knees and roll like a ball, pausing on back and not going onto feet when coming forward.                                                           |
|                        |                                                                                                    | Band as cradle for head and raise head and shoulders up, extend one leg, other in table top, switch extending leg out straight. Then with head in band opposite elbow/knee, first with toe tapping down then leg going from table top to                            |
|                        |                                                                                                    | straight, then with legs straight. Double leg raises and finally hundreds.                                                                                                                                                                                          |
|                        |                                                                                                    | Side line starting with open book, band round knees, clam, raised clam, extend legs pointed going out, bent coming back. Front kicks, two forwards, one back. Highland fling then big scissor kicks. All very hard with band.                                       |
|                        |                                                                                                    | Front with band underneath hips, palms facing inwards, push hips/groin down and lift sternum (keep head down) and lift arms, next lift arms then extend out to side.                                                                                                |
|                        |                                                                                                    | Hands and knees pull pubic bone up, shoulder blades back, sternum up and head straight, lift knees. Next move into plank position keeping core engaged and raise alternate legs.                                                                                    |
|                        |                                                                                                    | Myofascial release was good again, started on thighs at top, push pubic bone down and raise foot, then bring foot up to vertical and roll legs left and right. Pause when finding a pain point and rest there. Repeat moving down the                               |
|                        |                                                                                                    | leg. Next glute just behind the hip on side, then move backwards. Finally front of hip just inside, almost on front, but raise upper torso up to increase pressure.                                                                                                 |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| <2025-01-07 Tue 21:25> | Nice session after a long break. Started doing 15 minute sessions at home on my own based on book. | Warm up hips and arms/shoulders with circling weights then twisting through, squaring hips on opposite walls.                                                                                                                                                       |
|                        | Lots of weight work and good myofascial release.                                                   | Roll backs with weights, starting short, diving forward with weights low and head to knees returning to upright. A few at each height, curling back further down to eventually end with arms going overhead.                                                        |
|                        |                                                                                                    | Kneeling with weights arms out straight at shoulder heigh and leaning back, keeping core engaged and three boxes straight, repeat. Then repeat with arms above head (greater resistance). Don't arch back or bend and keep ribs down!                               |
|                        |                                                                                                    | Leg work was double leg raises with arms opening out (not enough space for circles), alternate side (remember to get lower shoulder off the floor) and more I can't remember always remember, but do remember to always keep lower back                             |
|                        |                                                                                                    | on the floor and engaged, shouldn't raise off.                                                                                                                                                                                                                      |
|                        |                                                                                                    | Side line was open book, raised clams, leg extensions, leg circles (both directions), lower leg raises and double leg raises, 10-12 of each.                                                                                                                        |
|                        |                                                                                                    | Bridge but with feet on weights, start with heels on floor, pelvic tilt first (repeat a few times) then move onto raising into bridge, as soon as back comes off floor toes should touch in fron of weights. Repeat. At the end try and                             |
|                        |                                                                                                    | roll weights forward and back 10 times (hard on the hamstrings!)                                                                                                                                                                                                    |
|                        |                                                                                                    | Back work lie on front arms at side raise sternum up whilst pushing pelvis down and into the floor, lift arms. Starfish with arms out and raising opposie arm/leg.                                                                                                  |
|                        |                                                                                                    | Good myofascial release down the front of the thighs/quads, starting at top lying on two balls at once, pushing pelvis into the floor then raising feet off the ground and lowering followed by bending knees up then gently rocking                                |
|                        |                                                                                                    | side to side. Repeat with balls lower down and then again nearer the knees. Pause on pain points and hold until relaxed.                                                                                                                                            |
|                        |                                                                                                    | Shoulder/upper back release lying on balls, arms up behind head, goal post out to v and then circles.                                                                                                                                                               |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
